Revit 2024 API
RebarContainerItem.IsRebarInSection Method
 Identifies if this rebar set is shown as a cross-section in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsRebarInSection(
	View dBView
)
Visual Basic
Public Function IsRebarInSection ( _
	dBView As View _
) As Boolean
Visual C++
public:
bool IsRebarInSection(
	View^ dBView
)
Parameters
dBView
Type: Autodesk.Revit.DB.View
 The view.
Return Value
 True if this rebar set is shown as a cross-section, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace